import pyximport; pyximport.install()
from unification_back import *

if __name__ == '__main__':
    text = '''
    Не лѣпо ли ны бяшетъ, братіе, начяти старыми словесы трудныхъ повѣстій о пълку Игоревѣ, Игоря Святъславлича?
    Начати же ся тъй пѣсни по былинамь сего времени, а не по замышленію Бояню!
    Боянъ бо вѣщій, аще кому хотяше пѣснь творити, то растѣкашется мыслію по древу,
    сѣрымъ вълкомъ по земли, шизымъ орломъ подъ облакы, помняшеть бо речь първыхъ временъ усобіцѣ. Тогда пущашеть і̃ соколовь на стадо лебедѣй,
    который дотечаше, та преди пѣсь пояше старому Ярослову, храброму Мстиславу, иже зарѣза Редедю предъ пълкы касожьскыми,
    красному Романови Святъславличю.
    Боянъ же, братіе, не і̃ соколовь на стадо лебедѣй пущаше, нъ своя вѣщіа пръсты на живая струны въскладаше, они же сами княземъ славу рокотаху.

    Молодой.
    вЭдръко и ведерко
    '''
    print(unify_text(text))
